app/controllers/boards_controller.rb

SELECT * FROM "boards"
SELECT * FROM "boards" WHERE ("boards"."user_id" IS NULL)
---
  def index
    @allboards = Board.all
	current_user = UserSession.find
	user_id = current_user && current_user.record.id
	@myboards = Board.find(:all, :conditions => {:user_id => user_id})

SELECT * FROM "boards" WHERE ("boards"."id" = 1)
---
  def show
    @board = Board.find(params[:id])

SELECT * FROM "boards" WHERE ("boards"."id" = 1)
---
  def edit
    @board = Board.find(params[:id])

SELECT id FROM "phrases" WHERE ("phrases"."professor_id" = 1)
INSERT INTO "boards" ("created_at", "professor_id", "updated_at", "generated", "user_id") VALUES('2010-04-01 14:08:44', 0, '2010-04-01 14:08:44', '2010-04-01 10:08:44', 0)
---
  def create
    @board = Board.new(params[:board])
	@board.generated = DateTime.now
	current_user = UserSession.find
	@board.user_id = current_user and current_user.record.id
	phrases = Array.new
	@items = Phrase.random(25, :conditions => {:professor_id => @board.professor})
	@items.sort_by{rand}.each do |phrase|
		phrases.push(phrase)
	end
	@board.phrases = phrases
    respond_to do |format|
      if @board.save

SELECT * FROM "boards" WHERE ("boards"."id" = 18)
DELETE FROM "boards" WHERE "id" = 18
---
  def destroy
    @board = Board.find(params[:id])
    @board.destroy