app/controllers/phrases_controller.rb

SELECT * FROM "phrases"
---
  def index
    @phrases = Phrase.all

SELECT * FROM "phrases" WHERE ("phrases"."id" = 1)
---
  def show
    @phrase = Phrase.find(params[:id])

SELECT * FROM "professors" WHERE ("professors"."id" = 1)
---
  def new
    @phrase = Phrase.new
	@professors = Professor.find(:all)

SELECT * FROM "phrases" WHERE ("phrases"."id" = 1)
---
  def edit
    @phrase = Phrase.find(params[:id])

INSERT INTO "phrases" ("created_at", "professor_id", "phrase_id", "updated_at", "text") VALUES('2010-03-30 06:18:14', 0, NULL, '2010-03-30 06:18:14', 'Test')
---
  def create
    @phrase = Phrase.new(params[:phrase])
    respond_to do |format|
      if @phrase.save

SELECT * FROM "phrases" WHERE ("phrases"."id" = 1)
UPDATE "phrases" SET "updated_at" = '2010-03-31 17:45:31', "professor_id" = 1, "text" = 'Test' WHERE "id" = 35
---
  def update
    @phrase = Phrase.find(params[:id])
	#@phrase.professor_id = (params[:professor])
    respond_to do |format|
      if @phrase.update_attributes(params[:phrase])

SELECT * FROM "phrases" WHERE ("phrases"."id" = 9)
DELETE FROM "phrases" WHERE "id" = 9
---
  def destroy
    @phrase = Phrase.find(params[:id])
    @phrase.destroy