app/controllers/professors_controller.rb

SELECT * FROM "professors"
---
  def index
    @professors = Professor.all

SELECT * FROM "professors" WHERE ("professors"."id" = 1)
---
  def show
    @professor = Professor.find(params[:id])

SELECT * FROM "professors" WHERE ("professors"."id" = 1)
---
  def board
	@professor = Professor.find(params[:id])

SELECT * FROM "schools" WHERE ("schools"."id" = 3)
---
  def new
    @professor = Professor.new
	@schools = School.find(:all)

SELECT * FROM "professors" WHERE ("professors"."id" = 1)
---
  def edit
    @professor = Professor.find(params[:id])

INSERT INTO "professors" ("name", "created_at", "prof_id", "updated_at", "user_id", "school_id") VALUES('test2', '2010-04-13 17:47:01', NULL, '2010-04-13 17:47:01', 2, 1)
---
  def create
    @professor = Professor.new(params[:professor])
	current_user = UserSession.find
	@professor.user = current_user.record
    respond_to do |format|
      if @professor.save

SELECT * FROM "professors" WHERE ("professors"."id" = 1)
UPDATE "professors" SET "updated_at" = '2010-03-30 04:31:55', "name" = 'Sriram Mohan 2' WHERE "id" = 1
---
  def update
    @professor = Professor.find(params[:id])

    respond_to do |format|
      if @professor.update_attributes(params[:professor])

SELECT * FROM "professors" WHERE ("professors"."id" = 3)
DELETE FROM "professors" WHERE "id" = 3
---
  def destroy
    @professor = Professor.find(params[:id])
    @professor.destroy